export const SAMPLE_DATA = [
    {
        id: 1,
        name: "Hamburger",
        shortDescription: "Good old American hamburger.",
        longDescription: "sfsdfs f sdf sdf sdfs fdsdf sfsdfsf",
        pictureURL: null,
        category: 'lunch'
    },{
        id: 2,
        name: "Pizza",
        shortDescription: "Delicious pizza from Italy",
        longDescription: "sfsdfs f sdf sdf sdfs fdsdf sfsdfsf dfd gg",
        pictureURL: null,
        category: 'dinner',
    },{
        id: 3,
        name: "Eggs and Bacon",
        shortDescription: "The meal of champions!",
        longDescription: "sfsdfs f sdf sdf sdfs fdsdf sfsdfsf dfd gg",
        pictureURL: null,
        category: 'breakfest',
    },{
        id: 4,
        name: "BLT Sub Sandwich",
        shortDescription: "A loved sandwich at any time.",
        longDescription: "sfsdfs f sdf sdf sdfs fdsdf sfsdfsf dfd gg",
        pictureURL: null,
        category: 'lunch',
    }
];

export const menu_food_data=[
  {
    id:1,
    name:"酸菜鱼",
    shortDescription:"酸菜鱼是一道很经典的菜",
    score:"5"
  },{
    id:2,
    name:"油泼面",
    shortDescription:"简单又美味",
    score:"5"
  },{
    id:3,
    name:"鱼香肉丝",
    shortDescription:"这道菜被家人和朋友称赞为“酒店级别”的",
    score:"5"
  },{
    id:4,
    name:"饺子",
    shortDescription:"代表家乡的美食",
    score:"5"
  },{
    id:5,
    name:"糖醋里脊",
    shortDescription:"糖醋里脊，里脊肉外酥里嫩，吃起来酸甜可口",
    score:"5"
  },{
    id:6,
    name:"肉夹馍",
    shortDescription:"西安人的风味小吃",
    score:"5"
  },{
    id:7,
    name:"宫保鸡丁",
    shortDescription:"宫保鸡丁色泽赤红诱人，酸辣口",
    score:"5"
  },
]

export const teach_food_data = [
  {
    id:1,
    name:"酸菜鱼",
    picture:"https://www.haocai777.com/Article/UploadFiles2012c/201610/2016101009452231.jpg",
    longDescription:"酸菜鱼是一道很经典的菜，酸辣爽口，鱼片滑嫩",
    ingredients:["黑鱼","酸菜"],
    step:["1. 鱼洗净去头。用刀从脊背处处理成两片",
    "2.鱼肉洗净，刀倾斜着片掉鱼骨和鱼腩，剩下净鱼肉",
    "3.鱼头、鱼骨洗净血污备用。这是后来鱼汤奶白的关键",
    "4.洗好的鱼片用一茶匙盐、一茶匙白胡椒、半个蛋清、三茶匙干淀粉腌渍，用手仔细反复抓拌均匀",
    "5.锅里放油炒香葱姜蒜，下入鱼头鱼尾鱼骨头鱼皮等炒一分钟",
    "6.放入酸菜继续炒一分钟。兑足量开水",
    "7.再用大火烧鱼汤，鱼片一点点放入",
    "8.锅里放油，凉油的时候就放入花椒和辣椒圈",
    "9.油大火烧冒青烟，浇在鱼片上即可"],
    tips:[
"1,鱼要鲜活，最好选择草鱼，黑鱼，鲶鱼，这种肉厚刺少的。酸菜也要买好，不然有一种怪味。好酸菜也要焯水，去掉腌渍菜的涩味。会更爽脆。",
"2,片好的鱼片，一定要用盐搓洗，盐可以让鱼片的水分掉一些，鱼肉紧致弹性好。不容易碎，洗净污水，换三遍水，鱼片成嫩白透明的为好",
"3，腌渍鱼片，放好所有的料，用手按摩抓一会。比较好入味",
"4，煮鱼片一定要最大火，下入鱼片的时候手脚一定要麻利，争取在十秒内放完，然后盖上盖子煮开。这时候的鱼片超级滑嫩的.",
"5，认真对待，我保证按照这种方式做出来的酸菜鱼，很多大饭店都赶不上的。因为咱们用的是真材实料。",
"6，鱼很多卖鱼的地方可以让他们给处理好，切成片。自己回来片鱼片。很多人认为鱼片厚了不容易碎，恰恰相反，越薄越不容易碎小!",
"7，酸菜鱼里面放点小米椒切碎，加粉丝，乌冬粉等在下面，也不错。"]
},{
    id:2,
    name:"油泼面",
    picture:"http://res.hoto.cn/5c52b37f0135db3ab01d5d5c.jpg!default",
    longDescription:"香喷喷的油泼扯面遇上野菜会发生什么呢？无以复加的美味缠绕在舌尖，这是我吃过的最好吃的油泼扯面",
    ingredients:["面条","辣椒粉"],
    step:["1.买扯面",
         "2.煮熟面条",
         "3.小锅倒油烧沸",
         "4.面条上放辣椒粉",
         "5.将热油倒入辣椒粉表面",
         "6.一碗又香又辣又酸的油泼扯面，配上野香菜、野青蒜粒味道超赞"],
    tips:"1.青菜可以和面条一起煮熟"
},{
id:3,
name:"鱼香肉丝",
picture:"https://ali.xinshipu.cn/20130321/original/1363853741335.jpg@288w_216h_50q_1e_1c.jpg",
longDescription:"这道菜被家人和朋友称赞为“酒店级别”的",
ingredients:["猪肉","里脊肉","青笋","木耳","豆瓣"],
step:["1.肉切丝，加少许盐、料酒和生粉腌制10分钟",
      "2.葱、姜、蒜切好备用",
      "3.准备好调味汁：蚝油两大勺， 生抽一大勺， 醋一大勺， 糖一大勺，豆瓣酱一大勺。调匀备用",
      "4.炒锅里把油烧热，放入葱、姜、蒜爆香后，加入肉丝滑炒。",
      "5.再倒入青椒和木耳，用装调味汁的小碗装点水，加进去，翻炒至酱汁浓稠并均匀裹在肉丝和配料上就可以了"],
tips:"不用再加其他的调味料了，中途还可以加点酱油让颜色更好看"
},{
id:4,
name:"饺子",
picture:"http://5b0988e595225.cdn.sohucs.com/images/20180105/94d8c5e3763640159208dbde0c4cae5e.jpeg",
longDescription:"饺子，又名水饺，原名“娇耳”，是古老的汉族传统面食，是中国北方大部分地区每年春节必吃的年节食品，深受中国广大人民喜爱",
ingredients:["饺子皮","韭菜","猪肉"],
step:["1.韭菜洗净切碎待用",
      "2.把切好的韭菜放在鸡蛋上面，加适量的盐，鸡精、五香粉、香油",
      "3.拌均匀，馅就做好了,饺子皮放在手上，沿饺子皮外圈抹一点水，这样饺子粘得比较牢。",
      "4.入清水烧开，加入一点盐（防饺子粘锅），然后把饺子放进去，加盖在煮开，然后在打开盖煮至皮熟。"],
tips:"饺子皮买现成的，包饺子的时候一定要注意不要放太多的菜"
},
{
id:5,
name:"糖醋里脊",
picture:"http://5b0988e595225.cdn.sohucs.com/images/20180613/6db00ce2bf064319a3b52c2ad2ab5e76.jpeg",
longDescription:"糖醋里脊，里脊肉外酥里嫩，吃起来酸甜可口。是一道不错的宴客菜。适合孩子和女性。",
ingredients:["里脊肉","番茄酱","淀粉","芝麻"],
step:["1.里脊肉切成等量大小的方块，用一个筷子放在下面，横着切成片，竖着切成条，底部不断",
      "2.切好的里脊丝，用盐，胡椒，蛋清，姜汁，抓匀腌渍十分钟,腌渍好的里脊丝，用干淀粉拌均匀，抖落一下附在上面的淀粉，放在漏勺里备用",
      "3.漏勺浸入八成热油里，迅速炸定型，捞出来，复炸一次。里脊肉不要炸时间长，老了就硬，正好的才会吃起来外酥里嫩",
      "4.锅里放番茄酱，白糖，半碗水，一起熬滚以后，煮一分钟。勾芡",
      "5.勾芡。浇在立即肉上即可"],
tips:["1.调汁很关键，这一口酸甜恰到好处的味儿，就在此。我用亨氏番茄酱，很好吃，亨氏番茄酱三份，绵白糖一份，水五份",
     "2.腌渍要用盐 胡椒粉  蛋清，盐要放足但是不能咸，和平时炒菜的量一样",
     "3.炸制要迅速，肉丝切细一点不用担心炸不熟。炸久了肉不嫩。还要二次复炸，复炸的目的是让外面更酥"],
   },
{
id:6,
name:"肉夹馍",
picture:"https://ali.xinshipu.cn/20120516/original/1337154158537.jpg@288w_216h_99q_1e_1c.jpg",
longDescription:"肉夹馍：用烤制的面饼，打中间用刀划开，夹入卤好的肥瘦相间的酱肉，再淋上肉汁，撒上香菜等，咬一口喷香",
ingredients:["五花肉","面粉"],
step:["1.选用瘦七肥三的猪五花肉，把五花肉切大段下开水锅，焯水去血沫",
      "2.把焯过水的五花肉晾凉后，用刀切成10公分长，5毫米厚的肉片",
      "3.砂锅里坐水放入大料，水热后放入切好的五花肉片",
      "4.大火煮开后放入酱油、精盐该改小火炖制1.5小时。",
      "5.把饧好的面团揪成小一点的面剂子，揉上劲后，擀成小薄饼。饧发40分钟,把饧好的面饼放入饼铛，小火烤制。",
      "6.把烤好的面饼，用刀在一边划开至3/4面饼，夹入切好的酱肉碎、青椒碎、撒上香菜末，淋上一匙肉汁，再来点红油即可"],
     tips:["可以加一点孜然和炒青椒，更可口美味"]
   },
{
id:7,
name:"宫保鸡丁",
picture:"https://ali.xinshipu.cn/20140823/original/1408782854509.jpg@288w_216h_99q_1e_1c.jpg",
longDescription:"宫保鸡丁色泽赤红诱，酸辣口，鸡肉滑嫩，花生米爽脆，大葱也好吃。是一道超级下饭菜，很多饭店都有宫保鸡丁盖浇饭，和宫保鸡丁面。",
ingredients:["鸡胸肉","大葱","油炸花生米","辣椒面"],
step:["1.鸡胸肉用刀背拍一下，切成大拇指甲大小的丁，用料酒一汤匙，食用油半汤匙，白胡椒半茶匙，盐半茶匙，淀粉一茶匙，腌渍十分钟入味",
      "2.葱切段,锅里放油，七八成热下鸡丁炒变白,放入干辣椒，葱和一茶匙花椒粉，炒出香味",
      "3.兑入料汁，大火炒到粘稠干松即可",
      "4.关火，拌入花生米即可"],
        tips:["1.我之所以用花椒粉，是因为炸花椒这个步骤，很危险，不小心就老了，而且碰到冷水会溅出来。",
            "2.不过，用鸡腿肉更好吃，更嫩，而且火候的掌握不是很苛刻！但是就是没有鸡胸肉能切丁好看",
            "3.这道菜全程要大火，煸炒鸡丁不能久，久了就会老。"]
      }
]
